In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
dem1=pd.read_csv("api_data_aadhar_biometric_0_500000.csv")

In [3]:
dem2=pd.read_csv("api_data_aadhar_biometric_500000_1000000.csv")

In [4]:
dem3=pd.read_csv("api_data_aadhar_biometric_1000000_1500000.csv")

In [5]:
dem4=pd.read_csv("api_data_aadhar_biometric_1500000_1861108.csv")

In [6]:
dem_combined=pd.concat([dem1, dem2, dem3, dem4],ignore_index=True)

In [7]:
df=dem_combined.copy()

In [8]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,01-03-2025,Haryana,Mahendragarh,123029,280,577
1,01-03-2025,Bihar,Madhepura,852121,144,369
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091
3,01-03-2025,Bihar,Bhojpur,802158,256,980
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815

In [9]:
df.shape

(1861108, 6)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1861108 entries, 0 to 1861107
Data columns (total 6 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   state         object
 2   district      object
 3   pincode       int64
 4   bio_age_5_17  int64
 5   bio_age_17_   int64
dtypes: int64(3), object(3)
memory usage: 85.2+ MB

In [11]:
df.describe()

            pincode  bio_age_5_17   bio_age_17_
count  1.861108e+06  1.861108e+06  1.861108e+06
mean   5.217612e+05  1.839058e+01  1.909413e+01
std    1.981627e+05  8.370421e+01  8.806502e+01
min    1.100010e+05  0.000000e+00  0.000000e+00
25%    3.911750e+05  1.000000e+00  1.000000e+00
50%    5.224010e+05  3.000000e+00  4.000000e+00
75%    6.866362e+05  1.100000e+01  1.000000e+01
max    8.554560e+05  8.002000e+03  7.625000e+03

In [12]:
df.isnull().sum()

date            0
state           0
district        0
pincode         0
bio_age_5_17    0
bio_age_17_     0
dtype: int64

In [14]:
df.duplicated().sum()

np.int64(94896)

In [15]:
df[df.duplicated()]

,date,state,district,pincode,bio_age_5_17,bio_age_17_
110000,01-09-2025,Chhattisgarh,Kondagaon,494229,0,1
110001,01-09-2025,Chhattisgarh,Kondagaon,494230,1,0
110002,01-09-2025,Chhattisgarh,Korba,495119,5,35
110003,01-09-2025,Chhattisgarh,Korba,495446,0,16
110004,01-09-2025,Chhattisgarh,Korba,495674,10,34
...,...,...,...,...,...,...
1860707,29-12-2025,Andhra Pradesh,Prakasam,523327,3,7
1860708,29-12-2025,Andhra Pradesh,Prakasam,523368,2,3
1860709,29-12-2025,Andhra Pradesh,Prakasam,523370,1,1
1860710,29-12-2025,Andhra Pradesh,Prakasam,523371,2,1
1860711,29-12-2025,Andhra Pradesh,Rangareddi,500005,2,1

In [16]:
df = df.drop_duplicates().reset_index(drop=True)
df

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,01-03-2025,Haryana,Mahendragarh,123029,280,577
1,01-03-2025,Bihar,Madhepura,852121,144,369
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091
3,01-03-2025,Bihar,Bhojpur,802158,256,980
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815
...,...,...,...,...,...,...
1766207,29-12-2025,West Bengal,Uttar Dinajpur,733201,4,9
1766208,29-12-2025,West Bengal,Uttar Dinajpur,733213,0,1
1766209,29-12-2025,West Bengal,West Midnapore,721304,0,3
1766210,29-12-2025,West Bengal,West Midnapore,721451,2,0
1766211,29-12-2025,West Bengal,West Midnapore,721457,0,1

In [17]:
df.duplicated().sum()

np.int64(0)

In [18]:
df.shape

(1766212, 6)

In [19]:
(df == "").sum()

date            0
state           0
district        0
pincode         0
bio_age_5_17    0
bio_age_17_     0
dtype: int64

In [20]:
(df.astype(str).apply(lambda x: x.str.strip() == "").sum())

date            0
state           0
district        0
pincode         0
bio_age_5_17    0
bio_age_17_     0
dtype: int64

In [21]:
df[df["pincode"].astype(str).str.len() != 6]   # no invalid pincodes.

Empty DataFrame
Columns: [date, state, district, pincode, bio_age_5_17, bio_age_17_]
Index: []

In [23]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,2025-03-01,Haryana,Mahendragarh,123029,280,577
1,2025-03-01,Bihar,Madhepura,852121,144,369
2,2025-03-01,Jammu and Kashmir,Punch,185101,643,1091
3,2025-03-01,Bihar,Bhojpur,802158,256,980
4,2025-03-01,Tamil Nadu,Madurai,625514,271,815

In [26]:
df['date'] = pd.to_datetime(df['date'], format='%d-%m-%Y')
df

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean
0,2025-03-01,Haryana,Mahendragarh,123029,280,577,haryana
1,2025-03-01,Bihar,Madhepura,852121,144,369,bihar
2,2025-03-01,Jammu and Kashmir,Punch,185101,643,1091,jammuandkashmir
3,2025-03-01,Bihar,Bhojpur,802158,256,980,bihar
4,2025-03-01,Tamil Nadu,Madurai,625514,271,815,tamilnadu
...,...,...,...,...,...,...,...
1766207,2025-12-29,West Bengal,Uttar Dinajpur,733201,4,9,westbengal
1766208,2025-12-29,West Bengal,Uttar Dinajpur,733213,0,1,westbengal
1766209,2025-12-29,West Bengal,West Midnapore,721304,0,3,westbengal
1766210,2025-12-29,West Bengal,West Midnapore,721451,2,0,westbengal
1766211,2025-12-29,West Bengal,West Midnapore,721457,0,1,westbengal

In [25]:
df["state"].value_counts()

state
Tamil Nadu                                  174934
Andhra Pradesh                              160202
Uttar Pradesh                               147138
Maharashtra                                 143609
Karnataka                                   135780
West Bengal                                 125274
Kerala                                       93951
Gujarat                                      84630
Odisha                                       83177
Bihar                                        78078
Telangana                                    77850
Rajasthan                                    76698
Madhya Pradesh                               66020
Punjab                                       46414
Assam                                        44418
Jharkhand                                    35054
Chhattisgarh                                 30048
Himachal Pradesh                             28723
Haryana                                      25083
Uttarakhand                                  21433
Jammu and Kashmir                            18597
Orissa                                       12767
Delhi                                         8784
Tripura                                       7949
Manipur                                       6252
Goa                                           5105
Meghalaya                                     4016
Arunachal Pradesh                             3957
Nagaland                                      3666
Mizoram                                       3217
Puducherry                                    2535
Sikkim                                        2298
Pondicherry                                   2240
Chandigarh                                    1576
Andaman and Nicobar Islands                   1190
Ladakh                                         688
Lakshadweep                                    525
Andaman & Nicobar Islands                      502
Daman and Diu                                  394
Jammu & Kashmir                                346
Dadra and Nagar Haveli                         310
Daman & Diu                                    252
Dadra and Nagar Haveli and Daman and Diu       214
Dadra & Nagar Haveli                            92
West Bangal                                     47
WEST BENGAL                                     31
andhra pradesh                                  30
ODISHA                                          25
West  Bengal                                    23
Westbengal                                      18
West bengal                                     17
odisha                                          15
WESTBENGAL                                      11
Chhatisgarh                                      5
Uttaranchal                                      2
west Bengal                                      1
Tamilnadu                                        1
Name: count, dtype: int64

In [ ]:
df['state_clean'] = df['state'].str.lower().str.strip().str.replace(r'[^a-z]', '', regex=True)

In [ ]:
df = df[df['state_final'].str.len() > 0]

In [27]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean
0,2025-03-01,Haryana,Mahendragarh,123029,280,577,haryana
1,2025-03-01,Bihar,Madhepura,852121,144,369,bihar
2,2025-03-01,Jammu and Kashmir,Punch,185101,643,1091,jammuandkashmir
3,2025-03-01,Bihar,Bhojpur,802158,256,980,bihar
4,2025-03-01,Tamil Nadu,Madurai,625514,271,815,tamilnadu